# GenericImportOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GenericImportOptions Properties
GenericImportOptions Class See Also
---
The GenericImportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RefPoint | Reference point (in Revit) to which the image is going to be inserted. |

# See Also
GenericImportOptions Class
Autodesk.Revit.DB Namespace